### Dataframes
<p>Datos tabulares bidimensionales, de tamaño variable y potencialmente heterogéneos</p>

In [1]:
import pandas as pd
personas = {
    'nombre': ['Jesus', 'Juan', 'Ana'],
    'edad': [21,34,50],
    'pais': ['Colombia', 'EE.UU', 'Brasil']
}#Diccionario

#Dataframe
df=pd.DataFrame(personas)
df

  nombre  edad      pais
0  Jesus    21  Colombia
1   Juan    34     EE.UU
2    Ana    50    Brasil

In [2]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [3]:
df.columns

Index(['nombre', 'edad', 'pais'], dtype='object')

In [4]:
df.info

<bound method DataFrame.info of   nombre  edad      pais
0  Jesus    21  Colombia
1   Juan    34     EE.UU
2    Ana    50    Brasil>

In [5]:
df.values

array([['Jesus', 21, 'Colombia'],
       ['Juan', 34, 'EE.UU'],
       ['Ana', 50, 'Brasil']], dtype=object)

In [6]:
df.size

9

In [7]:
df.shape

(3, 3)

In [8]:
df.head(1)

  nombre  edad      pais
0  Jesus    21  Colombia

In [9]:
df.insert(1,'newcol', [8,9,0], allow_duplicates=False)

In [10]:
df

  nombre  newcol  edad      pais
0  Jesus       8    21  Colombia
1   Juan       9    34     EE.UU
2    Ana       0    50    Brasil

In [14]:
df.pop('pais')

0    Colombia
1       EE.UU
2      Brasil
Name: pais, dtype: object